{"keras_version": "2.2.4", "class_name": "Model", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["ad_out", 0, 0], ["ev_out", 0, 0]], "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"batch_input_shape": [null, null, 1], "name": "input_1", "dtype": "float32", "sparse": false}, "inbound_nodes": []}, {"name": "sequential_10", "class_name": "Sequential", "config": {"name": "sequential_10", "layers": [], "build_input_shape": [null, null, 1]}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "conv1d_10", "class_name": "Conv1D", "config": {"activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [4], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "same", "name": "conv1d_10", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "Ones", "config": {}}}, "inbound_nodes": [[["sequential_10", 1, 0, {}]]]}, {"name": "batch_normalization_7", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.8, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "name": "batch_normalization_7", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"name": "activation_5", "class_name": "Activation", "config": {"name": "activation_5", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"name": "up_sampling1d_3", "class_name": "UpSampling1D", "config": {"name": "up_sampling1d_3", "size": 2, "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"name": "conv1d_11", "class_name": "Conv1D", "config": {"activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [4], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "filters": 32, "kernel_constraint": null, "padding": "same", "name": "conv1d_11", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}, "inbound_nodes": [[["up_sampling1d_3", 0, 0, {}]]]}, {"name": "batch_normalization_8", "class_name": "BatchNormalization", "config": {"gamma_regularizer": null, "center": true, "trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "beta_initializer": {"class_name": "Zeros", "config": {}}, "epsilon": 0.001, "momentum": 0.8, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "beta_constraint": null, "name": "batch_normalization_8", "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"name": "activation_6", "class_name": "Activation", "config": {"name": "activation_6", "trainable": true, "activation": "relu"}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"name": "conv1d_12", "class_name": "Conv1D", "config": {"activity_regularizer": null, "dilation_rate": [1], "data_format": "channels_last", "activation": "linear", "bias_initializer": {"class_name": "Zeros", "config": {}}, "strides": [1], "kernel_size": [4], "trainable": true, "bias_constraint": null, "bias_regularizer": null, "filters": 1, "kernel_constraint": null, "padding": "same", "name": "conv1d_12", "use_bias": true, "kernel_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"name": "max_pooling1d_4", "class_name": "MaxPooling1D", "config": {"padding": "same", "data_format": "channels_last", "pool_size": [2], "name": "max_pooling1d_4", "strides": [2], "trainable": true}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"name": "gru_7", "class_name": "GRU", "config": {"trainable": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "stateful": false, "unroll": false, "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_7", "units": 64, "return_state": false, "go_backwards": false, "bias_regularizer": null, "return_sequences": true, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "bias_constraint": null, "reset_after": false, "recurrent_activation": "hard_sigmoid", "implementation": 1, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"name": "gru_8", "class_name": "GRU", "config": {"trainable": true, "recurrent_dropout": 0.0, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "recurrent_initializer": {"class_name": "Orthogonal", "config": {"gain": 1.0, "seed": null}}, "dropout": 0.0, "stateful": false, "unroll": false, "kernel_constraint": null, "recurrent_regularizer": null, "name": "gru_8", "units": 64, "return_state": false, "go_backwards": false, "bias_regularizer": null, "return_sequences": false, "activity_regularizer": null, "activation": "tanh", "bias_initializer": {"class_name": "Zeros", "config": {}}, "recurrent_constraint": null, "bias_constraint": null, "reset_after": false, "recurrent_activation": "hard_sigmoid", "implementation": 1, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"name": "ad_out", "class_name": "TimeDistributed", "config": {"name": "ad_out", "trainable": true, "layer": {"class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_16", "units": 1, "use_bias": true, "kernel_regularizer": null}}}, "inbound_nodes": [[["gru_7", 0, 0, {}]]]}, {"name": "ev_out", "class_name": "Dense", "config": {"activity_regularizer": null, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"mode": "fan_avg", "scale": 1.0, "seed": null, "distribution": "uniform"}}, "activation": "sigmoid", "bias_initializer": {"class_name": "Zeros", "config": {}}, "bias_constraint": null, "bias_regularizer": null, "kernel_constraint": null, "name": "ev_out", "units": 1, "use_bias": true, "kernel_regularizer": null}, "inbound_nodes": [[["gru_8", 0, 0, {}]]]}]}, "backend": "tensorflow"}