{"backend": "tensorflow", "keras_version": "2.2.4", "config": {"input_layers": [["input_1", 0, 0]], "name": "model_1", "output_layers": [["ad_out", 0, 0], ["ev_out", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "config": {"dtype": "float32", "batch_input_shape": [null, null, 1], "name": "input_1", "sparse": false}, "inbound_nodes": []}, {"class_name": "Sequential", "name": "sequential_10", "config": {"name": "sequential_10", "build_input_shape": [null, null, 1], "layers": []}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_10", "config": {"dilation_rate": [1], "padding": "same", "kernel_regularizer": null, "kernel_size": [4], "strides": [1], "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 32, "activation": "linear", "kernel_initializer": {"config": {}, "class_name": "Ones"}, "name": "conv1d_10", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["sequential_10", 1, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_7", "config": {"gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "momentum": 0.8, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_7", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv1d_10", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_5", "config": {"name": "activation_5", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_7", 0, 0, {}]]]}, {"class_name": "UpSampling1D", "name": "up_sampling1d_3", "config": {"size": 2, "name": "up_sampling1d_3", "trainable": true}, "inbound_nodes": [[["activation_5", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_11", "config": {"dilation_rate": [1], "padding": "same", "kernel_regularizer": null, "kernel_size": [4], "strides": [1], "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 32, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_11", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["up_sampling1d_3", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "name": "batch_normalization_8", "config": {"gamma_regularizer": null, "epsilon": 0.001, "axis": -1, "beta_constraint": null, "gamma_constraint": null, "trainable": true, "center": true, "scale": true, "momentum": 0.8, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "name": "batch_normalization_8", "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "beta_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}}, "inbound_nodes": [[["conv1d_11", 0, 0, {}]]]}, {"class_name": "Activation", "name": "activation_6", "config": {"name": "activation_6", "activation": "relu", "trainable": true}, "inbound_nodes": [[["batch_normalization_8", 0, 0, {}]]]}, {"class_name": "Conv1D", "name": "conv1d_12", "config": {"dilation_rate": [1], "padding": "same", "kernel_regularizer": null, "kernel_size": [4], "strides": [1], "trainable": true, "data_format": "channels_last", "use_bias": true, "bias_constraint": null, "filters": 1, "activation": "linear", "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "name": "conv1d_12", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "inbound_nodes": [[["activation_6", 0, 0, {}]]]}, {"class_name": "MaxPooling1D", "name": "max_pooling1d_4", "config": {"padding": "same", "name": "max_pooling1d_4", "strides": [2], "trainable": true, "data_format": "channels_last", "pool_size": [2]}, "inbound_nodes": [[["conv1d_12", 0, 0, {}]]]}, {"class_name": "GRU", "name": "gru_7", "config": {"trainable": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_constraint": null, "implementation": 1, "dropout": 0.0, "kernel_constraint": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "bias_regularizer": null, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "gru_7", "activity_regularizer": null, "return_sequences": true, "reset_after": false, "activation": "tanh", "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "GRU", "name": "gru_8", "config": {"trainable": true, "recurrent_activation": "hard_sigmoid", "use_bias": true, "bias_constraint": null, "implementation": 1, "dropout": 0.0, "kernel_constraint": null, "units": 64, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "recurrent_regularizer": null, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "return_state": false, "bias_regularizer": null, "go_backwards": false, "stateful": false, "recurrent_dropout": 0.0, "recurrent_constraint": null, "name": "gru_8", "activity_regularizer": null, "return_sequences": false, "reset_after": false, "activation": "tanh", "unroll": false, "recurrent_initializer": {"config": {"gain": 1.0, "seed": null}, "class_name": "Orthogonal"}}, "inbound_nodes": [[["max_pooling1d_4", 0, 0, {}]]]}, {"class_name": "TimeDistributed", "name": "ad_out", "config": {"name": "ad_out", "layer": {"config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "dense_16"}, "class_name": "Dense"}, "trainable": true}, "inbound_nodes": [[["gru_7", 0, 0, {}]]]}, {"class_name": "Dense", "name": "ev_out", "config": {"kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "seed": null, "mode": "fan_avg", "scale": 1.0}, "class_name": "VarianceScaling"}, "trainable": true, "bias_regularizer": null, "use_bias": true, "bias_constraint": null, "activation": "sigmoid", "activity_regularizer": null, "units": 1, "kernel_constraint": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "name": "ev_out"}, "inbound_nodes": [[["gru_8", 0, 0, {}]]]}]}, "class_name": "Model"}